import React from 'react'

export const Songs = () => {
  // логика загрузки песен
  // логику переключения страниц. текущая страница, функция для изменения страницы
  // xерез юз жффект загружать данные при монтировании. В депенд передать текущую страницу, чттобы запрос выполнялся при изменений стриницы
  //

  // ВАЖНО

  // функция для получения данных - отдельно от таблицы
  //

  return (
    <>
      123
    </>
  )
}

// таблица с песнями по 25 штук
// пагинация внизу
// каждый элеент таблицы выводит
// картинка песни 50 на 50 +-
// name, artist.name, release date, edit button
